; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))

  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))

  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (and (calibrated ?i)))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (and (have_image ?d ?m))))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	satellite2 - satellite
	instrument4 - instrument
	instrument5 - instrument
	instrument6 - instrument
	satellite3 - satellite
	instrument7 - instrument
	instrument8 - instrument
	satellite4 - satellite
	instrument9 - instrument
	instrument10 - instrument
	infrared2 - mode
	infrared4 - mode
	image3 - mode
	infrared1 - mode
	thermograph0 - mode
	GroundStation4 - direction
	GroundStation2 - direction
	Star3 - direction
	Star1 - direction
	Star0 - direction
	Star5 - direction
	Planet6 - direction
	Planet7 - direction
	Star8 - direction
	Star9 - direction
	Star10 - direction
	Star11 - direction
	Star12 - direction
	Star13 - direction
	Phenomenon14 - direction
	Phenomenon15 - direction
	Planet16 - direction
	Planet17 - direction
)
(:init
	(supports instrument0 image3)
	(calibration_target instrument0 GroundStation4)
	(supports instrument1 infrared1)
	(supports instrument1 infrared2)
	(supports instrument1 image3)
	(calibration_target instrument1 Star3)
	(supports instrument2 thermograph0)
	(supports instrument2 infrared1)
	(calibration_target instrument2 Star0)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Planet7)
	(supports instrument3 image3)
	(supports instrument3 infrared4)
	(supports instrument3 infrared2)
	(calibration_target instrument3 Star1)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Planet17)
	(supports instrument4 infrared2)
	(calibration_target instrument4 Star1)
	(supports instrument5 infrared2)
	(supports instrument5 thermograph0)
	(calibration_target instrument5 GroundStation2)
	(supports instrument6 image3)
	(supports instrument6 infrared2)
	(calibration_target instrument6 Star3)
	(on_board instrument4 satellite2)
	(on_board instrument5 satellite2)
	(on_board instrument6 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Star13)
	(supports instrument7 image3)
	(calibration_target instrument7 Star1)
	(supports instrument8 infrared4)
	(supports instrument8 infrared2)
	(calibration_target instrument8 Star1)
	(on_board instrument7 satellite3)
	(on_board instrument8 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Star12)
	(supports instrument9 infrared1)
	(supports instrument9 image3)
	(supports instrument9 thermograph0)
	(calibration_target instrument9 Star0)
	(supports instrument10 thermograph0)
	(calibration_target instrument10 Star0)
	(on_board instrument9 satellite4)
	(on_board instrument10 satellite4)
	(power_avail satellite4)
	(pointing satellite4 Star11)
)
(:goal (and
	(pointing satellite0 Planet7)
	(pointing satellite4 Planet7)
	(have_image Star5 image3)
	(have_image Planet6 image3)
	(have_image Planet7 infrared2)
	(have_image Star8 infrared4)
	(have_image Star9 image3)
	(have_image Star10 infrared1)
	(have_image Star11 infrared2)
	(have_image Star12 infrared2)
	(have_image Star13 infrared4)
	(have_image Phenomenon14 infrared4)
	(have_image Phenomenon15 infrared1)
	(have_image Planet16 infrared4)
	(have_image Planet17 infrared2)
))

)

; plan
1. (switch_on instrument8 satellite3)
   deleted: (power_avail satellite3)
   added: (power_on instrument8)
   goals met: 1 of 15
2. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 1 of 15
3. (switch_on instrument9 satellite4)
   deleted: (power_avail satellite4)
   added: (power_on instrument9)
   goals met: 1 of 15
4. (turn_to satellite4 phenomenon15 star11)
   deleted: (pointing satellite4 star11)
   added: (pointing satellite4 phenomenon15)
   goals met: 1 of 15
5. (turn_to satellite4 star0 phenomenon15)
   deleted: (pointing satellite4 phenomenon15)
   added: (pointing satellite4 star0)
   goals met: 1 of 15
6. (calibrate satellite4 instrument9 star0)
   added: (calibrated instrument9)
   goals met: 1 of 15
7. (turn_to satellite4 phenomenon15 star0)
   deleted: (pointing satellite4 star0)
   added: (pointing satellite4 phenomenon15)
   goals met: 1 of 15
8. (take_image satellite4 phenomenon15 instrument9 infrared1)
   added: (have_image phenomenon15 infrared1)
   goals met: 2 of 15
9. (turn_to satellite4 planet6 phenomenon15)
   deleted: (pointing satellite4 phenomenon15)
   added: (pointing satellite4 planet6)
   goals met: 2 of 15
10. (take_image satellite4 planet6 instrument9 image3)
   added: (have_image planet6 image3)
   goals met: 3 of 15
11. (turn_to satellite4 planet7 planet6)
   deleted: (pointing satellite4 planet6)
   added: (pointing satellite4 planet7)
   goals met: 4 of 15
12. (turn_to satellite3 star1 star12)
   deleted: (pointing satellite3 star12)
   added: (pointing satellite3 star1)
   goals met: 4 of 15
13. (calibrate satellite3 instrument8 star1)
   added: (calibrated instrument8)
   goals met: 4 of 15
14. (turn_to satellite3 phenomenon14 star1)
   deleted: (pointing satellite3 star1)
   added: (pointing satellite3 phenomenon14)
   goals met: 4 of 15
15. (take_image satellite3 phenomenon14 instrument8 infrared4)
   added: (have_image phenomenon14 infrared4)
   goals met: 5 of 15
16. (turn_to satellite3 planet16 phenomenon14)
   deleted: (pointing satellite3 phenomenon14)
   added: (pointing satellite3 planet16)
   goals met: 5 of 15
17. (take_image satellite3 planet16 instrument8 infrared4)
   added: (have_image planet16 infrared4)
   goals met: 6 of 15
18. (turn_to satellite3 planet17 planet16)
   deleted: (pointing satellite3 planet16)
   added: (pointing satellite3 planet17)
   goals met: 6 of 15
19. (take_image satellite3 planet17 instrument8 infrared2)
   added: (have_image planet17 infrared2)
   goals met: 7 of 15
20. (turn_to satellite3 planet7 planet17)
   deleted: (pointing satellite3 planet17)
   added: (pointing satellite3 planet7)
   goals met: 7 of 15
21. (take_image satellite3 planet7 instrument8 infrared2)
   added: (have_image planet7 infrared2)
   goals met: 8 of 15
22. (turn_to satellite3 star11 planet7)
   deleted: (pointing satellite3 planet7)
   added: (pointing satellite3 star11)
   goals met: 8 of 15
23. (take_image satellite3 star11 instrument8 infrared2)
   added: (have_image star11 infrared2)
   goals met: 9 of 15
24. (turn_to satellite3 star12 star11)
   deleted: (pointing satellite3 star11)
   added: (pointing satellite3 star12)
   goals met: 9 of 15
25. (take_image satellite3 star12 instrument8 infrared2)
   added: (have_image star12 infrared2)
   goals met: 10 of 15
26. (turn_to satellite3 star13 star12)
   deleted: (pointing satellite3 star12)
   added: (pointing satellite3 star13)
   goals met: 10 of 15
27. (take_image satellite3 star13 instrument8 infrared4)
   added: (have_image star13 infrared4)
   goals met: 11 of 15
28. (turn_to satellite3 star8 star13)
   deleted: (pointing satellite3 star13)
   added: (pointing satellite3 star8)
   goals met: 11 of 15
29. (take_image satellite3 star8 instrument8 infrared4)
   added: (have_image star8 infrared4)
   goals met: 12 of 15
30. (turn_to satellite4 star10 planet7)
   deleted: (pointing satellite4 planet7)
   added: (pointing satellite4 star10)
   goals met: 11 of 15
31. (take_image satellite4 star10 instrument9 infrared1)
   added: (have_image star10 infrared1)
   goals met: 12 of 15
32. (turn_to satellite4 planet7 star10)
   deleted: (pointing satellite4 star10)
   added: (pointing satellite4 planet7)
   goals met: 13 of 15
33. (turn_to satellite4 star5 planet7)
   deleted: (pointing satellite4 planet7)
   added: (pointing satellite4 star5)
   goals met: 12 of 15
34. (take_image satellite4 star5 instrument9 image3)
   added: (have_image star5 image3)
   goals met: 13 of 15
35. (turn_to satellite4 planet7 star5)
   deleted: (pointing satellite4 star5)
   added: (pointing satellite4 planet7)
   goals met: 14 of 15
36. (turn_to satellite4 star9 planet7)
   deleted: (pointing satellite4 planet7)
   added: (pointing satellite4 star9)
   goals met: 13 of 15
37. (take_image satellite4 star9 instrument9 image3)
   added: (have_image star9 image3)
   goals met: 14 of 15
38. (turn_to satellite4 planet7 star9)
   deleted: (pointing satellite4 star9)
   added: (pointing satellite4 planet7)
   goals met: 15 of 15
